# St7SetDampingType

Sets the type of damping used for the analysis.

long St7SetDampingType(long uID, long DampType)
Input Parameters
uID
Strand7 model file ID.
DampType
One of dtNoDamping, dtRayleighDamping, dtModalDamping or dtPropertyDamping.